app/controllers/assesments_controller.rb

SELECT * FROM "assesments" WHERE (id IN (2,2)) ORDER BY created_at DESC
---
  def index
    @assesments = Assesment.all :order => "created_at DESC"

INSERT INTO "assesments" ("created_at", "updated_at", "user_id", "delete_at", "shape_content_type", "shape_file_size", "shape_file_name", "shape_updated_at", "state") VALUES('2009-12-07 13:44:29.056554', '2009-12-07 13:44:29.056554', NULL, NULL, E'application/zip', 97999, E'wdpa_2_export.zip', '2009-12-07 13:44:25.476394', NULL) RETURNING "id"
---
    Dir.new(directory).each do |f|
      if f.ends_with? ".shp"
        #CREATE ASSESSMENT
        @assesment ||= Assesment.create(:file_name => file_name)

INSERT INTO "tenements" ("created_at", "attribute_data", "updated_at", "the_geom", "assesment_id") VALUES('2009-12-08 03:58:20.441550', E'--- !ruby/object:DBF::Record
---
        #READ IN AND CREATE TENEMENTS
        GeoRuby::Shp4r::ShpFile.open(File.join(directory,f)) do |shp|
          shp.each do |shape|
            @assesment.tenements.create :the_geom => shape.geometry, :attribute_data => shape.data